bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
#if 0
static AT_ERROR_CODE cipdns_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE act(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE mode(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE save(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE load(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE status(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE factory(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE peer(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE ping(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sockw(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sockq(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sockr(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sockc(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sockd(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE wifi(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE reassociate(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE gpioc(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE gpior(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE gpiow(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sleep(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE wakeupgpio(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwlapopt(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwlap(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwdhcp_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipstamac_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipsta_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwhostname(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipdomain(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE tcpservermaxconn(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipmux(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipmode(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE ciprecvdata(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE ciprecvmode(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sysiosetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sysiogetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE syssetiodir(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE syssetgpio(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE sysreadgpio(at_callback_para_t *para, at_callback_rsp_t *rsp);
#endif

static const callback_handler_t callback_tbl[] = {
#if 0
    {ACC_ACT,               act},
#endif
    {ACC_RST,               reset},
#if 0
    {ACC_MODE,              mode},
    {ACC_SAVE,              save},
    {ACC_LOAD,              load},
    {ACC_STATUS,            status},
    {ACC_FACTORY,           factory},
    {ACC_PEER,              peer},
    {ACC_PING,              ping},
    {ACC_SOCKON,            sockon},
    {ACC_SOCKW,             sockw},
    {ACC_SOCKQ,             sockq},
    {ACC_SOCKR,             sockr},
    {ACC_SOCKC,             sockc},
    {ACC_SOCKD,             sockd},
    {ACC_WIFI,              wifi},
    {ACC_REASSOCIATE,       reassociate},
    {ACC_GPIOC,             gpioc},
    {ACC_GPIOR,             gpior},
    {ACC_GPIOW,             gpiow},
#endif
    {ACC_SCAN,              scan},
    {ACC_CIPSTATUS,         cipstatus},
    {ACC_GMR,               version},
    {ACC_RESTORE,           restory},
    {ACC_UART_SET,          uart_set},
    {ACC_UART_GET,          uart_get},
    {ACC_DEEP_SLEEP,        deep_sleep},
#if 0
    {ACC_SLEEP,             sleep},
    {ACC_WAKEUPGPIO,        wakeupgpio},
#endif
    {ACC_CWMODE_CUR,        cwmode_cur},
    {ACC_CWMODE_GET,        cwmode_cur_get},
    {ACC_CWJAP_CUR, cwjap_cur},
    {ACC_CWJAP_INFO, cwjap_info},
#if 0
    {ACC_CWLAPOPT,          cwlapopt},
    {ACC_CWLAP,             cwlap},
#endif
    {ACC_CWQAP, cwqap},
#if 0
    {ACC_CWDHCP_CUR,        cwdhcp_cur},
    {ACC_CIPSTAMAC_CUR,     cipstamac_cur},
    {ACC_CIPSTA_CUR,        cipsta_cur},
    {ACC_CWHOSTNAME,        cwhostname},
    {ACC_CIPDOMAIN,         cipdomain},
#endif
    {ACC_APCFG,             set_apcfg},
    {ACC_AP_STA_GET, ap_sta_get},
    {ACC_CIPSTART, cipstart},
    {ACC_CIPSENDBUF, cipsendbuf},
    {ACC_CIPCLOSE, cipclose},
    {ACC_TCPSERVER, tcpserver},
    {ACC_CIPSEND, cipsend},
    {ACC_HTTP_REQ, http_url_req},
#if 0
    {ACC_TCPSERVERMAXCONN,  tcpservermaxconn},
    {ACC_CIPMUX,            cipmux},
    {ACC_CIPMODE,           cipmode},
    {ACC_CIPRECVDATA,       ciprecvdata},
    {ACC_CIPRECVMODE,       ciprecvmode},
    {ACC_CIPDNS_CUR,        cipdns_cur},
    {ACC_SYSIOSETCFG,       sysiosetcfg},
    {ACC_SYSIOGETCFG,       sysiogetcfg},
    {ACC_SYSGPIODIR,        syssetiodir},
    {ACC_SYSGPIOWRITE,      syssetgpio},
    {ACC_SYSGPIOREAD,       sysreadgpio},
#endif
};

#if 0
static const u32 channel_freq_tbl[] = {
    2412,2417,2422,2427,2432,2437,2442,2447,2452,2457,2462,2467,2472
};

static const char *event[] = {
    "wlan connected",
    "wlan disconnected",
    "wlan scan success",
    "wlan scan failed",
    "wlan 4way handshake failed",
    "wlan connect failed",
    "wlan connect loss",
    "network up",
    "network down",
};

static const fdcm_handle_t fdcm_hdl_tbl[] = {
    {CONFIG_FDCM_FLASH, CONFIG_FDCM_ADDR, CONFIG_FDCM_SIZE},
    {CONFIG_FDCM_FLASH, CONFIG_FDCM_ADDR - CONFIG_FDCM_SIZE, CONFIG_FDCM_SIZE}
};

