bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
}

static AT_ERROR_CODE save(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    config_containner_t *containner;
    s32 i;
    fdcm_handle_t *fdcm_hdl;
    u32 flag[2];
    s32 idx,cnt;

    containner = (config_containner_t *)malloc(2*sizeof(config_containner_t));

    if (containner == NULL) {
        FUN_DEBUG("malloc faild.\r\n");
        return AEC_NOT_ENOUGH_MEMORY;
    }

    for (i=0; i<TABLE_SIZE(fdcm_hdl_tbl); i++) {
        flag[i] = 1;

        fdcm_hdl = fdcm_open(fdcm_hdl_tbl[i].flash, fdcm_hdl_tbl[i].addr, fdcm_hdl_tbl[i].size);

        if (fdcm_hdl == NULL) {
            FUN_DEBUG("fdcm_open faild.\r\n");
            free(containner);
            return AEC_UNDEFINED;
        }

        if (fdcm_read(fdcm_hdl, &containner[i], CONFIG_CONTAINNER_SIZE) != CONFIG_CONTAINNER_SIZE) {
            flag[i] = 0;
        }

        fdcm_close(fdcm_hdl);
    }

    if(flag[0] && flag[1]) {
        if (containner[0].cnt > containner[1].cnt) {
            idx = 1;
            cnt = containner[0].cnt;
        } else {
            idx = 0;
            cnt = containner[1].cnt;
        }
    } else if(flag[0]) {
        idx = 1;
        cnt = containner[0].cnt;
    } else if(flag[1]) {
        idx = 0;
        cnt = containner[1].cnt;
    } else {
        idx = 0;
        cnt = 0;
    }

    fdcm_hdl = fdcm_open(fdcm_hdl_tbl[idx].flash, fdcm_hdl_tbl[idx].addr, fdcm_hdl_tbl[idx].size);

    if (fdcm_hdl == NULL) {
        FUN_DEBUG("fdcm_open faild.\r\n");
        free(containner);
        return AEC_UNDEFINED;
    }

    containner[idx].cnt = cnt + 1;
    memcpy(&containner[idx].cfg, para->cfg, sizeof(at_config_t));

    if (fdcm_write(fdcm_hdl, &containner[idx], CONFIG_CONTAINNER_SIZE) != CONFIG_CONTAINNER_SIZE) {
        FUN_DEBUG("fdcm_write faild.\r\n");
        fdcm_close(fdcm_hdl);
        free(containner);
        return AEC_UNDEFINED;
    }

    fdcm_close(fdcm_hdl);
    free(containner);

    return AEC_OK;
}

static AT_ERROR_CODE load(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    config_containner_t *containner;
    s32 i;
    fdcm_handle_t *fdcm_hdl;
    u32 flag[2];
    s32 idx;

    containner = (config_containner_t *)malloc(2*sizeof(config_containner_t));

    if (containner == NULL) {
        FUN_DEBUG("malloc faild.\r\n");
        free(containner);
        return AEC_UNDEFINED;
    }

    for (i=0; i<TABLE_SIZE(fdcm_hdl_tbl); i++) {
        flag[i] = 1;

        fdcm_hdl = fdcm_open(fdcm_hdl_tbl[i].flash, fdcm_hdl_tbl[i].addr, fdcm_hdl_tbl[i].size);

        if (fdcm_hdl == NULL) {
            FUN_DEBUG("fdcm_open faild.\r\n");
            free(containner);
            return AEC_UNDEFINED;
        }

        if (fdcm_read(fdcm_hdl, &containner[i], CONFIG_CONTAINNER_SIZE) != CONFIG_CONTAINNER_SIZE) {
            flag[i] = 0;
        }

        fdcm_close(fdcm_hdl);
    }

    if(flag[0] && flag[1]) {
        if (containner[0].cnt > containner[1].cnt) {
            idx = 0;
        } else {
            idx = 1;
        }
    } else if(flag[0]) {
        idx = 0;
    } else if(flag[1]) {
        idx = 1;
    } else {
        FUN_DEBUG("load fiald.\r\n");
        free(containner);
        return AEC_UNDEFINED;
    }

    memcpy(para->cfg, &containner[idx].cfg, sizeof(at_config_t));

    free(containner);

    return AEC_OK;
}

static AT_ERROR_CODE status(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    struct netif *nif = g_wlan_netif;
    s32 i;

    memset(para->sts, 0, sizeof(*para->sts));

    if (nif == NULL) {
        return AEC_UNDEFINED;
    }

    if (NET_IS_IP4_VALID(nif) && netif_is_link_up(nif)) {
        memcpy(para->sts->ip_ipaddr, &nif->ip_addr, 4);
        memcpy(para->sts->ip_gw, &nif->gw, 4);
        memcpy(para->sts->ip_netmask, &nif->netmask, 4);
    }

    para->sts->current_time = time(NULL);

    para->sts->ip_sock_open = 0;

    for (i=0; i<MAX_SOCKET_NUM; i++) {
        if (networks.connect[i].flag) {
            para->sts->ip_sock_open |= (1<<i);
        }
    }

    if (g_server_enable) {
        para->sts->ip_sockd_port = g_server_arg.port;
    }

    wlan_ap_sta_num(&para->sts->wifi_num_assoc);

    return AEC_OK;
}

static AT_ERROR_CODE factory(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    struct sysinfo *psysinfo;

    memcpy(para->cfg, &default_cfg, sizeof(at_config_t));

    /* non-volatile config */
    strcpy(para->cfg->nv_manuf, MANUFACTURER);
    strcpy(para->cfg->nv_model, MODEL);
    strcpy(para->cfg->nv_serial, SERIAL);
#if PRJCONF_SYSINFO_SAVE_TO_FLASH
    sysinfo_load();
#endif
    psysinfo = sysinfo_get();
    memcpy(para->cfg->nv_wifi_macaddr, psysinfo->mac_addr, sizeof(para->cfg->nv_wifi_macaddr));

    save(para, NULL);

    return AEC_OK;
}

uint16_t net_get_status(void)
{
    return net_evevt_state;
}

extern s32 test_ping(char *hostname, int count);
static AT_ERROR_CODE ping(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    test_ping(para->u.ping.hostname,3);

    return AEC_OK;
}

static AT_ERROR_CODE peer(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}
#endif

#define SOCKET_TASK_STACK_SIZE (1 * 1024)
#define QLEN_ATCMDSEND 5

static TaskHandle_t socket_task_handler[5];
static QueueHandle_t q_SocketSend[5];

static AT_ERROR_CODE socket_task_delete(int linkId) {
  if (linkId >= MAX_SOCKET_NUM) {
    return AEC_SOCKET_FAIL;
  }
  if (networks.connect[linkId].ThreadHd != 0) {
      if (q_SocketSend[linkId]) {
          vQueueDelete(q_SocketSend[linkId]);
          q_SocketSend[linkId] = NULL;
      }
      networks.connect[linkId].ThreadHd = 0;
      if (socket_task_handler[linkId]) {
          vTaskDelete(socket_task_handler[linkId]);
      }
  }
  return AEC_OK;
}

static AT_ERROR_CODE disconnect(s32 id) {
  FUN_DEBUG("disconnect id = %d!\r\n", id);
  if (networks.connect[id].flag) {
    networks.connect[id].flag = 0;
    at_dump("+IPS:%d,DISCONNECT", id);
    vTaskDelay(pdMS_TO_TICKS(200));

    closesocket(networks.connect[id].fd);
    FUN_DEBUG("disconnect closesocket id = %d!\r\n", id);
    networks.connect[id].fd = -1;
    networks.connect[id].flag = 0;
    networks.count--;
    socket_task_delete((int)id);
    return AEC_OK;
  }
  return AEC_DISCONNECT;
}

static TaskHandle_t OS_Thread_sockon_handler;
static QueueHandle_t OS_queue_sockon_handler;
AT_ERROR_CODE socket_task_create(int linkId);
typedef struct {
  at_callback_para_t para;
  at_callback_rsp_t rsp;
} at_sockontask_para_t;
at_sockontask_para_t sockontask_data;

