bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
static void sockon_task(void *arg) {
  AT_ERROR_CODE ret;
  BaseType_t status;
  at_sockontask_para_t sockpara;

  while (1) {
    status = xQueueReceive(OS_queue_sockon_handler, &sockpara, portMAX_DELAY);
    if (status == pdPASS) {
      ret = sockon(&sockpara.para, &sockpara.rsp);
      if (AEC_OK == ret) {
        ret = socket_task_create(sockpara.para.u.net_param.linkId);
      }
      if (AEC_SOCKET_EXISTING == ret) {
        at_dump("+IPS:%d,ALREADY CONNECTED ERROR", sockpara.para.u.net_param.linkId);
      }
      // FIXME(Zhuoran) fd => linkId
      if (AEC_OK == ret) {
        at_dump("+IPS:%d,CONNECTED", sockpara.para.u.net_param.linkId);
      } else {
        at_dump("+IPS:%d,FAILED", sockpara.para.u.net_param.linkId);
      }
      ret = AEC_UNDEFINED;
      memset(&sockpara, 0, sizeof(at_sockontask_para_t));
    }
  }
}
#if 0
static void __server_task_entry(void *arg)
{
    server_arg_t *server_arg;

    server_arg = arg;

    do {
        if (server_arg->protocol == 0) { /* TCP */
            struct sockaddr_in server_addr;
            struct sockaddr_in conn_addr;
            int sock_fd;                  /* server socked */
            int sock_conn;        /* request socked */
            socklen_t addr_len;
            int err;
            int option;

            sock_fd = socket(AF_INET, SOCK_STREAM, 0);
            if (sock_fd == -1) {
                FUN_DEBUG("failed to create sock_fd!\r\n");
                break;
            }

            server_mutex_lock();
            g_server_net.sock_fd = sock_fd;
            server_mutex_unlock();

            FUN_DEBUG("sock fd = %d\r\n", sock_fd);

            memset(&server_addr, 0, sizeof(server_addr));
            server_addr.sin_family = AF_INET;
            server_addr.sin_addr.s_addr =htonl(INADDR_ANY);
            server_addr.sin_port = htons(server_arg->port);

            option = 1;
            if (setsockopt(sock_fd, SOL_SOCKET, SO_REUSEADDR, (char *)&option, sizeof(option)) < 0) {
                FUN_DEBUG("failed to setsockopt sock_fd!\r\n");
                closesocket(sock_fd);
                break;
            }

            option = 1;
            if (setsockopt(sock_fd, SOL_SOCKET, SO_REUSEPORT, (char *)&option, sizeof(option)) < 0) {
                FUN_DEBUG("failed to setsockopt sock_fd!\r\n");
                closesocket(sock_fd);
                break;
            }

            err = bind(sock_fd, (struct sockaddr *)&server_addr, sizeof(server_addr));
            if (err < 0) {
                FUN_DEBUG("bind err = %d\r\n", err);
                FUN_DEBUG("failed to bind sock_fd!\r\n");
                closesocket(sock_fd);
                break;
            }

            err = listen(sock_fd, 1);
            if (err < 0) {
                FUN_DEBUG("failed to listen sock_fd!\r\n");
                closesocket(sock_fd);
                break;
            }

            addr_len = sizeof(struct sockaddr_in);

            while (1) {
                if (xSemaphoreTake(g_server_sem, portMAX_DELAY) != pdTRUE)
                    continue;

                FUN_DEBUG("before accept!\r\n");
                sock_conn = accept(sock_fd, (struct sockaddr *)&conn_addr, &addr_len);
                FUN_DEBUG("after accept!\r\n");

                if (sock_conn > 0) {
                    server_mutex_lock();
                    g_server_net.flag = 1;
                    g_server_net.conn_fd = sock_conn;
                    server_mutex_unlock();
                }

                FUN_DEBUG("conn fd = %d\r\n", sock_conn);
            }
        } else if (server_arg->protocol == 1) { /* UDP */
            /* do nothing */
        }
    } while (0);

    server_mutex_lock();
    g_server_net.flag = 0;
    g_server_net.sock_fd = -1;
    g_server_net.conn_fd = -1;
    server_mutex_unlock();

    FUN_DEBUG("%s() end\r\n", __func__);
    vTaskDelete(g_server_thread);
}
#endif
static AT_ERROR_CODE sockon(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  int type;
  int family;
  struct addrinfo hints_tcp = {0, AF_INET, SOCK_STREAM, IPPROTO_TCP, 0, NULL, NULL, NULL};
  struct addrinfo hints_udp = {0, AF_INET, SOCK_DGRAM, IPPROTO_UDP, 0, NULL, NULL, NULL};

  int rc = -1;
  struct sockaddr_in address;
  struct addrinfo *result = NULL;
  s32 id = -1;
  int fd = 0;

  int socketid = para->u.net_param.linkId;

  rsp->status = 0;

  if (socketid >= 4) return AEC_PARA_ERROR;

  if (networks.connect[socketid].flag) {
    sprintf(rsp->vptr, "ALREADY CONNECT");
    rsp->type = 1;
    rsp->status = 1;
    return AEC_SOCKET_EXISTING;
  }

  strncpy(networks.connect[socketid].type, para->u.net_param.type, 4);
  /*
      if (networks.connect[socketid].fd != -1) {
          return AEC_SOCKET_FAIL;
      }
  */

  strncpy(networks.connect[socketid].ip, para->u.net_param.hostname, IP_ADDR_SIZE);
  networks.connect[socketid].port = para->u.net_param.port;

  if (strcmp(para->u.net_param.networkType, "TCP") == 0) {
    networks.connect[socketid].protocol = 0;
  } else if (strcmp(para->u.net_param.networkType, "UDP") == 0) {
    networks.connect[socketid].protocol = 1;
  } else {
    return AEC_PARA_ERROR;
  }

  if (networks.connect[socketid].protocol == 0) { /* TCP */
    type = SOCK_STREAM;
    family = AF_INET;
    if ((rc = getaddrinfo(networks.connect[socketid].ip, NULL, &hints_tcp, &result)) == 0) {
      struct addrinfo *res = result;

      while (res) {
        if (res->ai_family == family) {
          result = res;
          break;
        }
        res = res->ai_next;
      }

      if (result->ai_family == family) {
        address.sin_port = htons(networks.connect[socketid].port);
        address.sin_family = family;
        address.sin_addr = ((struct sockaddr_in *)(result->ai_addr))->sin_addr;
      } else
        rc = -1;

      freeaddrinfo(result);
    }

    if (rc == 0) {
      fd = socket(family, type, 0);
      if (fd < 0) return AEC_SOCKET_FAIL;

      rc = connect(fd, (struct sockaddr *)&address, sizeof(address));
      if (rc < 0) {
        closesocket(fd);
        return AEC_CONNECT_FAIL;
      }

    } else {
      return AEC_CONNECT_FAIL;
    }

    networks.connect[socketid].fd = fd;
    networks.connect[socketid].flag = 1;

    networks.count++;

    memset(&socket_cache[socketid], 0, sizeof(socket_cache_t));

    rsp->type = 0;
    return AEC_OK;
  } else if (networks.connect[socketid].protocol == 1) { /* UDP */
    type = SOCK_DGRAM;
    family = AF_INET;
    if ((rc = getaddrinfo(networks.connect[socketid].ip, NULL, &hints_udp, &result)) == 0) {
      struct addrinfo *res = result;

      while (res) {
        if (res->ai_family == family) {
          result = res;
          FUN_DEBUG("sockon UDP getaddrinfo aifamily!\r\n");
          break;
        }
        res = res->ai_next;
      }

      if (result->ai_family == family) {
        address.sin_port = htons(networks.connect[socketid].port);
        address.sin_family = family;
        address.sin_addr.s_addr = htonl(INADDR_ANY);
      } else
        rc = -1;

      freeaddrinfo(result);
    }

