bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    if (rc == 0) {
      fd = socket(family, type, 0);
      if (fd < 0) return AEC_SOCKET_FAIL;

      /* for receive */
      FUN_DEBUG("sockon UDP bind address prot = %d!\r\n", networks.connect[socketid].port);
      rc = bind(fd, (struct sockaddr *)&address, sizeof(address));
      if (rc < 0) {
        closesocket(fd);
        return AEC_BIND_FAIL;
      }
    } else {
      return AEC_BIND_FAIL;
    }

    networks.connect[socketid].fd = fd;
    networks.connect[socketid].flag = 1;

    networks.count++;

    memset(&socket_cache[socketid], 0, sizeof(socket_cache_t));

    rsp->type = 0;
    rsp->vptr = (void *)id;

    return AEC_OK;
  }
  return AEC_CMD_FAIL;
}

#if 0
static AT_ERROR_CODE sockw(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    s32 id;
    u8 *buffer;
    s32 len;
    struct sockaddr_in address;
    s32 timeout_ms = 10;
    int sentLen = 0;

    id = para->u.sockw.id;
    buffer = para->u.sockw.buf;
    len = para->u.sockw.len;

    if (networks.count > 0) {
        if (networks.connect[id].flag) {
            if (networks.connect[id].protocol == 0) { /* TCP */
                int rc = -1;
                fd_set fdset;
                struct timeval tv;

                FD_ZERO(&fdset);
                FD_SET(networks.connect[id].fd, &fdset);

                tv.tv_sec = timeout_ms / 1000;
                tv.tv_usec = (timeout_ms % 1000) * 1000;

                rc = select(networks.connect[id].fd + 1, NULL, &fdset, NULL, &tv);
                if (rc > 0) {
                    if ((rc = send(networks.connect[id].fd, buffer, len, 0)) > 0)
                        sentLen = rc;
                    else if (rc == 0) {
                        disconnect(id);
                        sentLen = -1; /* disconnected with server */
                    } else {
                        sentLen = -2; /* network error */
                    }
                } else if (rc == 0) {
                    sentLen = 0; /* timeouted and sent 0 bytes */
                } else {
                    sentLen = -2; /* network error */
                }
            } else if (networks.connect[id].protocol == 1) { /* UDP */
                int rc = -1;
                fd_set fdset;
                struct timeval tv;

                FD_ZERO(&fdset);
                FD_SET(networks.connect[id].fd, &fdset);

                tv.tv_sec = timeout_ms / 1000;
                tv.tv_usec = (timeout_ms % 1000) * 1000;

                address.sin_port = htons(networks.connect[id].port);
                address.sin_family = AF_INET;
                address.sin_addr.s_addr= inet_addr(networks.connect[id].ip);

                rc = select(networks.connect[id].fd + 1, NULL, &fdset, NULL, &tv);
                if (rc > 0) {
                    if ((rc = sendto(networks.connect[id].fd, buffer, len, 0, (struct sockaddr *)&address, sizeof(address))) > 0)
                        sentLen = rc;
                    else if (rc == 0) {
                        disconnect(id);
                        sentLen = -1; /* disconnected with server */
                    } else {
                        sentLen = -2; /* network error */
                    }
                } else if (rc == 0) {
                    sentLen = 0; /* timeouted and sent 0 bytes */
                } else {
                    sentLen = -2; /* network error */
                }
            }
        } else {
            return AEC_DISCONNECT;
        }
    } else {
        return AEC_DISCONNECT;
    }

    if (sentLen == -1) {
        return AEC_DISCONNECT;
    } else if (sentLen == -2) {
        return AEC_NETWORK_ERROR;
    } else if (sentLen == len) {
        return AEC_OK;
    } else {
        return AEC_SEND_FAIL;
    }
}


typedef struct Timer Timer;

struct Timer {
    unsigned int end_time;
};


/** countdown_ms - set timeout value in mil seconds
 * @param timer - timeout timer where the timeout value save
 * @param timeout_ms - timeout in timeout_ms mil seconds
 */
static void countdown_ms(Timer* timer, unsigned int timeout_ms)
{
    timer->end_time = OS_TicksToMSecs(OS_GetTicks()) + timeout_ms;
}

/** countdown - set timeout value in seconds
 * @param timer - timeout timer where the timeout value save
 * @param timeout - timeout in timeout seconds
 */
/*
static void countdown(Timer* timer, unsigned int timeout)
{
countdown_ms(timer, timeout * 1000);
}
*/

/** left_ms - calculate how much time left before timeout
 * @param timer - timeout timer
 * @return the time left befor timeout, or 0 if it has expired
 */
static int left_ms(Timer* timer)
{
    int diff = (int)(timer->end_time) - (int)(OS_TicksToMSecs(OS_GetTicks()));
    return (diff < 0) ? 0 : diff;
}

/** expired - has it already timeouted
 * @param timer - timeout timer
 * @return 0 if it has already timeout, or otherwise.
 */
static char expired(Timer* timer)
{
    return 0 <= (int)OS_TicksToMSecs(OS_GetTicks()) - (int)(timer->end_time); /* is time_now over than end time */
}

static AT_ERROR_CODE read_socket(s32 id)
{
    int recvLen = 0;
    int leftms;
    int rc = -1;
    struct timeval tv;
    Timer timer;
    fd_set fdset;
    struct sockaddr_in address;
    socklen_t addr_len;

    u8 *buffer;
    s32 len;
    s32 timeout_ms = 10;

    buffer = socket_cache[id].buffer;
    len = SOCKET_CACHE_BUFFER_SIZE;

    countdown_ms(&timer, timeout_ms);

    do {
        leftms = left_ms(&timer);
        tv.tv_sec = leftms / 1000;
        tv.tv_usec = (leftms % 1000) * 1000;

        FD_ZERO(&fdset);
        FD_SET(networks.connect[id].fd, &fdset);

        rc = select(networks.connect[id].fd + 1, &fdset, NULL, NULL, &tv);
        if (rc > 0) {
            if (networks.connect[id].protocol == 0) { /* TCP */
                rc = recv(networks.connect[id].fd, buffer + recvLen, len - recvLen, 0);
            } else if (networks.connect[id].protocol == 1) { /* UDP */
                address.sin_port = htons(networks.connect[id].port);
                address.sin_family = AF_INET;
                address.sin_addr.s_addr= inet_addr(networks.connect[id].ip);

