bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
                addr_len = sizeof(address);

                rc = recvfrom(networks.connect[id].fd, buffer + recvLen, len - recvLen, 0, (struct sockaddr *)&address, &addr_len);
            }

            if (rc > 0) {
                /* received normally */
                recvLen += rc;
            } else if (rc == 0) {
                /* has disconnected with server */
                recvLen = -1;
                break;
            } else {
                /* network error */
                recvLen = -2;
                break;
            }
        } else if (rc == 0) {
            /* timeouted and return the length received */
            break;
        } else {
            /* network error */
            recvLen = -2;
            break;
        }
    } while (recvLen < len && !expired(&timer)); /* expired() is redundant? */

    if (recvLen >= 0) {
        if (recvLen > 0) {
            socket_cache[id].cnt = recvLen;
            socket_cache[id].offset = 0;
            socket_cache[id].flag = 1;
        }

        return AEC_OK;
    } else if (recvLen == -1) {
        return AEC_DISCONNECT;
    } else if (recvLen == -2) {
        return AEC_NETWORK_ERROR;
    } else {
        return AEC_UNDEFINED;
    }
}

static AT_ERROR_CODE sockq(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec;
    s32 id;

    id = para->u.sockq.id;

    if (networks.count > 0) {
        if (networks.connect[id].flag) {
            if (socket_cache[id].flag) {
                rsp->type = 0;
                rsp->vptr = (void *)socket_cache[id].cnt;

                return AEC_OK;
            }

            aec = read_socket(id);
            if (aec != AEC_OK) {
                return aec;
            }

            if (socket_cache[id].flag) {
                rsp->type = 0;
                rsp->vptr = (void *)socket_cache[id].cnt;

                return AEC_OK;
            } else {
                rsp->type = 0;
                rsp->vptr = (void *)0;

                return AEC_OK;
            }
        } else {
            return AEC_DISCONNECT;
        }
    } else {
        return AEC_DISCONNECT;
    }
}

static AT_ERROR_CODE sockr(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec;
    s32 id;
    u8 *buffer;
    s32 len,rlen;

    id = para->u.sockr.id;
    len = para->u.sockr.len;

    if (networks.count > 0) {
        if (networks.connect[id].flag) {
            /* FUN_DEBUG("len = %d\r\n", len); */
            if (len > 0) {
                if (!socket_cache[id].flag) {

                    aec = read_socket(id);
                    if (aec != AEC_OK) {
                        return aec;
                    }
                }

                if (socket_cache[id].flag) {
                    buffer = socket_cache[id].buffer;
                    rlen = len < socket_cache[id].cnt ? len : socket_cache[id].cnt;

                    serial_write(&buffer[socket_cache[id].offset], rlen);

                    socket_cache[id].cnt -= rlen;
                    socket_cache[id].offset += rlen;
                    len -= rlen;

                    if (socket_cache[id].cnt <= 0) {
                        socket_cache[id].flag = 0;
                    }
                }
            }
        } else {
            return AEC_DISCONNECT;
        }
    } else {
        return AEC_DISCONNECT;
    }

    return AEC_OK;
}

static AT_ERROR_CODE sockc(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    s32 id;

    id = para->u.sockc.id;

    if (networks.count > 0) {
        if (networks.connect[id].flag) {
            closesocket(networks.connect[id].fd);
            networks.connect[id].flag = 0;
            networks.count--;

            return AEC_OK;
        }
    }

    return AEC_DISCONNECT;
}
#endif
static int serversock_fd = -1;   /* server socked */
static TaskHandle_t server_task_handle = NULL;
static void server_task(void *arg) {
  server_arg_t *server_arg;
  server_arg = arg;
  int ret;

  do {
    if (server_arg->protocol == 0) { /* TCP */
      struct sockaddr_in server_addr;
      struct sockaddr_in conn_addr;
      int sock_conn; /* request socked */
      socklen_t addr_len;
      int err;
      int option;

      serversock_fd = socket(AF_INET, SOCK_STREAM, 0);
      if (serversock_fd == -1) {
        FUN_DEBUG("failed to create sock_fd!\r\n");
        break;
      }

      FUN_DEBUG("sock fd = %d\r\n", sock_fd);

      memset(&server_addr, 0, sizeof(server_addr));
      server_addr.sin_family = AF_INET;
      server_addr.sin_addr.s_addr = htonl(INADDR_ANY);
      server_addr.sin_port = htons(server_arg->port);

      option = 1;
      if (setsockopt(serversock_fd, SOL_SOCKET, SO_REUSEADDR, (char *)&option, sizeof(option)) < 0) {
        FUN_DEBUG("failed to setsockopt sock_fd!\r\n");
        closesocket(serversock_fd);
        break;
      }

//      option = 1;
//      if (setsockopt(sock_fd, SOL_SOCKET, SO_REUSEPORT, (char *)&option, sizeof(option)) < 0) {
//        FUN_DEBUG("failed to setsockopt sock_fd!\r\n");
//        closesocket(sock_fd);
//        break;
//      }

      err = bind(serversock_fd, (struct sockaddr *)&server_addr, sizeof(server_addr));
      if (err < 0) {
        FUN_DEBUG("bind err = %d\r\n", err);
        FUN_DEBUG("failed to bind sock_fd!\r\n");
        closesocket(serversock_fd);
        break;
      }

      err = listen(serversock_fd, 1);
      if (err < 0) {
        FUN_DEBUG("failed to listen sock_fd!\r\n");
        closesocket(serversock_fd);
        break;
      }

      addr_len = sizeof(struct sockaddr_in);

      // FIXME(Zhuoran) 此处阻塞在accept上，然后停掉server，g_server_enable=0，但是accept未跳出
      // 然后又来一次CIPSERVER
      while (g_server_enable) {
        int linkId;

        FUN_DEBUG("before accept!\r\n");
        sock_conn = accept(serversock_fd, (struct sockaddr *)&conn_addr, &addr_len);
        FUN_DEBUG("after accept!\r\n");

        FUN_DEBUG("conn fd = %d\r\n", sock_conn);
        for (linkId = 0; linkId < MAX_SOCKET_NUM; linkId++) {
          if (networks.connect[linkId].flag == 0){
            memset(&networks.connect[linkId], 0, sizeof(networks.connect[linkId]));
            break;
          }
        }
        if (networks.connect[linkId].flag != 0) {
          // TODO no avaliable connect slot
          // 关闭Server Socket
          break;
        }
        networks.count++;

        // set connect parameter
        networks.connect[linkId].fd = sock_conn;
        networks.connect[linkId].flag = 1;
        networks.connect[linkId].protocol = 0;
        networks.connect[linkId].port = conn_addr.sin_port;
        // FIXME(Zhuoran.rong) add peer ip address
        // networks.connect[linkId].ip = conn_addr.sin_port;
        strcpy(networks.connect[linkId].type, "TCP");

        ret = socket_task_create(linkId);
        if (AEC_OK == ret) {
          at_dump("+IPS:%d,CONNECTED", linkId);
        } else {
          at_dump("+IPS:%d,FAILED", linkId);
        }
      }

      closesocket(serversock_fd);
    } else if (server_arg->protocol == 1) { /* UDP */
                                            /* do nothing */
    }
  } while (0);
  

  FUN_DEBUG("%s() end\r\n", __func__);
  vTaskDelete(NULL);
}

