bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
#if 0
static AT_ERROR_CODE sockd(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    s16 port;
    s32 protocol;

    port = para->u.sockd.port;
    protocol = para->u.sockd.protocol;

    if (port > 0) {
        if (!g_server_enable) {
            g_server_arg.port = para->u.sockd.port;
            g_server_arg.protocol = para->u.sockd.protocol;
            memset(&socket_cache[MAX_SOCKET_NUM], 0,sizeof(socket_cache_t));

            if (protocol == 0) { /* TCP */
                server_mutex_lock();
                g_server_net.flag = 0;
                g_server_net.sock_fd = -1;
                g_server_net.conn_fd = -1;
                server_mutex_unlock();

                if (OS_SemaphoreCreate(&g_server_sem, 1, 1) != OS_OK) {
                    FUN_DEBUG("create semaphore failed\r\n");

                    return AEC_UNDEFINED;
                }

                if (OS_ThreadCreate(&g_server_thread,
                                    "",
                                    server_task,
                                    &g_server_arg,
                                    OS_PRIORITY_NORMAL,
                                    SERVER_THREAD_STACK_SIZE) != OS_OK) {
                    FUN_DEBUG("create server task failed\r\n");

                    return AEC_UNDEFINED;
                }

                memset(&g_server_ctrl, 0, sizeof(g_server_ctrl));
            } else if (protocol == 1) { /* UDP */
                struct sockaddr_in  address;
                int rc;
                int fd;

                fd = socket(AF_INET, SOCK_DGRAM, 0);
                if (fd < 0) {
                    return AEC_SOCKET_FAIL;
                }

                memset(&address, 0, sizeof(address));
                address.sin_family = AF_INET;
                address.sin_addr.s_addr =htonl(INADDR_ANY);
                address.sin_port = htons(port);
                /* for receive */
                rc = bind(fd, (struct sockaddr *)&address, sizeof(address));
                if (rc < 0) {
                    closesocket(fd);
                    return AEC_BIND_FAIL;
                }

                server_mutex_lock();
                g_server_net.flag = 1;
                g_server_net.sock_fd = -1;
                g_server_net.conn_fd = fd;
                server_mutex_unlock();
            }

            g_server_enable = 1;

            return AEC_OK;
        }
    } else if (g_server_enable) {
        u32 flag;
        s32 sock_fd,conn_fd;

        server_mutex_lock();
        flag = g_server_net.flag;
        sock_fd = g_server_net.sock_fd;
        conn_fd = g_server_net.conn_fd;
        server_mutex_unlock();

        if (g_server_arg.protocol == 0) { /* TCP */
            if (sock_fd != -1) {
                FUN_DEBUG("close fd = %d\r\n", sock_fd);
                closesocket(sock_fd);
            }

            if (flag) {
                FUN_DEBUG("close fd = %d\r\n", conn_fd);
                closesocket(conn_fd);
            }

            OS_SemaphoreDelete(&g_server_sem);
            OS_ThreadDelete(&g_server_thread);

        } else if (g_server_arg.protocol == 1) { /* UDP */
            if (flag) {
                FUN_DEBUG("close fd = %d\r\n", conn_fd);
                closesocket(conn_fd);
            }
        }

        g_server_enable = 0;

        return AEC_OK;
    }

    return AEC_UNDEFINED;
}

static AT_ERROR_CODE wifi(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec = AEC_OK;

    switch (para->cfg->wifi_mode) {
    case 0: /* IDLE */
        aec = AEC_IMPROPER_OPERATION;
        break;

    case 1: /* STA */

        if (para->u.wifi.value == 0) {
            wlan_sta_disable();
        } else if (para->u.wifi.value == 1) {
            wlan_sta_enable();
        } else {
            aec = AEC_PARA_ERROR;
        }

        break;

    case 2: /* AP */

        if (para->u.wifi.value == 0) {
            wlan_ap_disable();
        } else if (para->u.wifi.value == 1) {
            wlan_ap_enable();
        } else {
            aec = AEC_PARA_ERROR;
        }

        break;

    case 3: /* IBSS */
        aec = AEC_IMPROPER_OPERATION;
        break;

    default:

        aec = AEC_PARA_ERROR;

        break;
    }

    return aec;
}

static AT_ERROR_CODE reassociate(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    wlan_sta_connect();

    return AEC_OK;
}

static AT_ERROR_CODE gpioc(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static AT_ERROR_CODE gpior(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static AT_ERROR_CODE gpiow(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static s32 freq_to_chan(s32 freq)
{
    s32 i;

    for (i = 0; i < TABLE_SIZE(channel_freq_tbl); ++i) {
        if(freq == channel_freq_tbl[i]) {
            break;
        }
    }

    if(i >= TABLE_SIZE(channel_freq_tbl)) {
        return -1;
    }

    return i+1;
}
#endif

extern char *wifi_mgmr_auth_to_str(uint8_t auth);

static void insert_sort(wifi_mgmr_ap_item_t *ap_ary, int *a, int n)
{
    int i, j, x;

    for(i = 1; i < n; i++){
        if(ap_ary[a[i]].rssi > ap_ary[a[i-1]].rssi){
            j= i-1;
            x = a[i];
            while(j>-1 && ap_ary[x].rssi > ap_ary[a[j]].rssi){
                a[j+1] = a[j];
                j--;
            }
            a[j+1] = x;
        }
    }
}

static void scan_result_sort(wifi_mgmr_ap_item_t *ap_ary, int cnt, uint8_t opt)
{
    int i;

    int *a = malloc(cnt * sizeof(int *));
    if (a == NULL) {
        printf("mem not enought\r\n");
        return;
    }

    for (i = 0; i < cnt; i++) {
        a[i] = i;
    }

    if (BIT_GET(opt, 5)) {
        insert_sort(ap_ary, a, cnt);
    }

    at_serial_lock();
    at_dump("+CWLAP:");
    for (i = 0; i < cnt; i++) {
        if (strlen((char *)ap_ary[a[i]].ssid) > 0) {
            at_dump_noend(AT_CMD_ECHOSTART"%02d", i);
            if (BIT_GET(opt, 1)) {
                at_dump_noend(",%s", ap_ary[a[i]].ssid);
            }
            if (BIT_GET(opt, 3)) {
                at_dump_noend(",%02x:%02x:%02x:%02x:%02x:%02x",
                              ap_ary[a[i]].bssid[0],
                              ap_ary[a[i]].bssid[1],
                              ap_ary[a[i]].bssid[2],
                              ap_ary[a[i]].bssid[3],
                              ap_ary[a[i]].bssid[4],
                              ap_ary[a[i]].bssid[5]);
            }
            if (BIT_GET(opt, 4)) {
                at_dump_noend(",%02d", ap_ary[a[i]].channel);
            }
            if (BIT_GET(opt, 2)) {
                at_dump_noend(",%02d", ap_ary[a[i]].rssi);
            }
            if (BIT_GET(opt, 0)) {
                at_dump_noend(",%s", wifi_mgmr_auth_to_str(ap_ary[a[i]].auth));
            }
            at_dump_noend(AT_CMD_TAILED);
            vTaskDelay(pdMS_TO_TICKS(5));
        }
    }
    at_serial_unlock();
    free(a);
}

static AT_ERROR_CODE scan(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
#if 0
    AT_ERROR_CODE aec = AEC_OK;
    int ret = -1;
    int size;
    char ssid[32+1];
    wlan_sta_scan_results_t results;

    if (para->cfg->wifi_mode != 1) { /* STA */
        return AEC_IMPROPER_OPERATION;
    }

