bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    wlan_sta_scan_once();

    size = MAX_SCAN_RESULTS;

    results.ap = cmd_malloc(size * sizeof(wlan_sta_ap_t));
    if (results.ap == NULL) {
        aec = AEC_SCAN_FAIL;
    }

    if (aec == AEC_OK) {
        results.size = size;
        ret = wlan_sta_scan_result(&results);

        if (ret == 0) {
            /* cmd_wlan_sta_print_scan_results(&results); */
            int i;

            for (i = 0; i < results.num; i++) {
                memcpy(ssid, results.ap[i].ssid.ssid, results.ap[i].ssid.ssid_len);
                ssid[results.ap[i].ssid.ssid_len] = '\0';
                at_dump("%2d    BSS %02X:%02X:%02X:%02X:%02X:%02X    SSID: %-32.32s    "
                        "CHAN: %2d    RSSI: %d    flags: %08x    wpa_key_mgmt: %08x    "
                        "wpa_cipher: %08x    wpa2_key_mgmt: %08x    wpa2_cipher: %08x\n",
                        i + 1, (results.ap[i].bssid)[0], (results.ap[i].bssid)[1],
                        (results.ap[i].bssid)[2], (results.ap[i].bssid)[3],
                        (results.ap[i].bssid)[4], (results.ap[i].bssid)[5],
                        ssid, freq_to_chan(results.ap[i].freq),results.ap[i].level,
                        results.ap[i].wpa_flags, results.ap[i].wpa_key_mgmt,
                        results.ap[i].wpa_cipher,results.ap[i].wpa2_key_mgmt,
                        results.ap[i].wpa2_cipher);
            }
        }

        cmd_free(results.ap);
    }

    return aec;
#else
    AT_ERROR_CODE aec = AEC_OK;
    uint32_t cnt;
    int ret;
    wifi_mgmr_ap_item_t *ap_ary = NULL;
    uint8_t opt = 0;

    if (at_key_value_get(SAVE_KEY_WIFISCAN_OPT, &opt) != 0) {
        opt = 0xff;
    }
    ret = wifi_mgmr_all_ap_scan(&ap_ary, &cnt);
    if (ret != 0) {
        printf("wifi all ap scan error %d\r\n", ret);
    }
    else {
        printf("Scan done: %lu ap info\r\n", cnt);
        scan_result_sort(ap_ary, cnt, opt);
        if (ap_ary != NULL) {
            vPortFree(ap_ary);
        }
    }
    return aec;
#endif
}

static AT_ERROR_CODE version(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    at_dump("+GMR:fw:\"%s-%s\"", BL_SDK_PHY_VER, BL_SDK_RF_VER);

    at_dump("+GMR:sdk:\""BL_SDK_VER"\"");

    at_dump("+GMR:tm:\"%s %s\"",__DATE__,__TIME__);
    return AEC_OK;
}

static AT_ERROR_CODE restory(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\n");

    ef_env_set_default();

    return AEC_OK;
}

#if 0
// UART Config
static UART_CFG_Type uartCfg =
{
    160*1000*1000,                                        /* UART clock */
    115200,                                              /* UART Baudrate */
    UART_DATABITS_8,                                     /* UART data bits length */
    UART_STOPBITS_1,                                     /* UART data stop bits length */
    UART_PARITY_NONE,                                    /* UART no parity */
    DISABLE,                                             /* Disable auto flow control */
    DISABLE,                                             /* Disable rx input de-glitch function */
    DISABLE,                                             /* Disable RTS output SW control mode */
    UART_LSB_FIRST                                       /* UART each data byte is send out LSB-first */
};
static UART_FifoCfg_Type fifoCfg =
{
    .txFifoDmaThreshold     = 0x10,
    .rxFifoDmaThreshold     = 0x10,
    .txFifoDmaEnable        = DISABLE,
    .rxFifoDmaEnable        = DISABLE,
};
#endif

static AT_ERROR_CODE uart_get(at_callback_para_t * para, at_callback_rsp_t * rsp) {
  
//  para->u.uart.uartBaud = uartCfg.baudRate;
//  para->u.uart.dataBit = uartCfg.dataBits + 5;
//  para->u.uart.stopBit = uartCfg.stopBits + 1;
//  para->u.uart.parity = uartCfg.parity;
//
//  if (uartCfg.ctsFlowControl == ENABLE && uartCfg.rtsSoftwareControl == ENABLE) {
//    para->u.uart.hwfc = 3;
//  } else if (uartCfg.ctsFlowControl == DISABLE && uartCfg.rtsSoftwareControl == ENABLE) {
//    para->u.uart.hwfc = 1;
//  } else if (uartCfg.ctsFlowControl == ENABLE && uartCfg.rtsSoftwareControl == DISABLE) {
//    para->u.uart.hwfc = 2;
//  } else if (uartCfg.ctsFlowControl == DISABLE && uartCfg.rtsSoftwareControl == DISABLE) {
//    para->u.uart.hwfc = 0;
//  } else {
//    return AEC_CMD_ERROR;
//  }
  at_key_value_get(SAVE_KEY_UART_BAUD, &para->u.uart.uartBaud);
  at_key_value_get(SAVE_KEY_UART_DATABIT, &para->u.uart.dataBit);
  at_key_value_get(SAVE_KEY_UART_STOPBIT, &para->u.uart.stopBit);
  at_key_value_get(SAVE_KEY_UART_PARITY, &para->u.uart.parity);
  at_key_value_get(SAVE_KEY_UART_HWFC, &para->u.uart.hwfc);
  
  return AEC_OK;
}

static AT_ERROR_CODE uart_set(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    int ret;

    printf("at_para.baudrate = %d\r\n", para->u.uart.uartBaud);

    ret = at_serial_cfg_set(para->u.uart.uartBaud,
                            para->u.uart.dataBit,
                            para->u.uart.stopBit,
                            para->u.uart.parity,
                            para->u.uart.hwfc);
    if (ret != 0) {
        return AEC_PARA_ERROR;
    }
    at_key_value_set(SAVE_KEY_UART_BAUD, &para->u.uart.uartBaud);
    at_key_value_set(SAVE_KEY_UART_DATABIT, &para->u.uart.dataBit);
    at_key_value_set(SAVE_KEY_UART_STOPBIT, &para->u.uart.stopBit);
    at_key_value_set(SAVE_KEY_UART_PARITY, &para->u.uart.parity);
    at_key_value_set(SAVE_KEY_UART_HWFC, &para->u.uart.hwfc);

    return AEC_OK;
}

static AT_ERROR_CODE deep_sleep(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    uint32_t sleep_time = para->u.sleep.sleep_time;
    uint8_t weakup_pin = para->u.sleep.weakup_pin;
    FUN_DEBUG("----->\r\n");

    if ((weakup_pin != 7) && (weakup_pin != 8)) {
        return AEC_CMD_FAIL;
    }

    hal_hbn_init(&weakup_pin, 1);
    at_dump("OK");
    vTaskDelay(100);
    sleep_time = sleep_time * 1000;
    hal_hbn_enter(sleep_time);
    at_dump("+GSLP:WEAKUP");
    return AEC_NO_RESPONSE;
}

#if 0
/*
enum suspend_state_t {
    PM_MODE_ON              = 0,
    PM_MODE_SLEEP           = 1,
    PM_MODE_STANDBY         = 2,
    PM_MODE_HIBERNATION     = 3,
    PM_MODE_POWEROFF        = 4,
    PM_MODE_MAX             = 5,
};
*/
#include "pm/pm.h"

