bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
static AT_ERROR_CODE sleep(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    if(para->u.sleep.sleepMode < 0 || para->u.sleep.sleepMode > 5) {
        printf("The sleep mode is not support \r\n");
        return AEC_CMD_ERROR;
    } else {
        at_dump("OK");

        at_wakeup_gpio_init(5,0);
        OS_MSleep(5);
        pm_enter_mode(para->u.sleep.sleepMode);

    }
    return AEC_BLANK_LINE;
}

static AT_ERROR_CODE wakeupgpio(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("-->%s\r\n",__func__);

    at_wakeup_gpio_init(para->u.wakeupgpio.gpioId,para->u.wakeupgpio.edge);

    return AEC_OK;
}
#endif

enum wlan_mode {
    WIFI_DISABLE = 0,
    WIFI_STATION_MODE,
    WIFI_SOFTAP_MODE,
    WIFI_AP_STA_MODE,
};

static char g_soft_ap_ssid[65] = {0};

static AT_ERROR_CODE __wifimode_set(int mode)
{
    memset(g_soft_ap_ssid, 0, sizeof(g_soft_ap_ssid));
    if (mode == WIFI_DISABLE) {
        wifi_mgmr_sta_disconnect();
        vTaskDelay(1000);
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
    } else if (mode == WIFI_STATION_MODE) {
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
        g_wifi_interface = wifi_mgmr_sta_enable();
    } else if (mode == WIFI_SOFTAP_MODE) {
        wifi_mgmr_sta_disconnect();
        vTaskDelay(1000);
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
        g_wifi_interface = wifi_mgmr_ap_enable();
    } else {
        printf("The mode is not support \r\n");
        return AEC_CMD_ERROR;
    }
    return AEC_OK;
}

static AT_ERROR_CODE cwmode_cur(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    int now_mode;
    FUN_DEBUG("----->\r\n");

    if(para->u.wifiMode.mode < 0 || para->u.wifiMode.mode >= WIFI_AP_STA_MODE) {
        printf("The mode is not support \r\n");
        return AEC_CMD_ERROR;
    }
    at_key_value_get(SAVE_KEY_WIFI_MODE, &now_mode);
    if (now_mode == para->u.wifiMode.mode) {
        return AEC_OK;
    }
    at_key_value_set(SAVE_KEY_WIFI_MODE, &para->u.wifiMode.mode);
    return __wifimode_set(para->u.wifiMode.mode);
}

static AT_ERROR_CODE cwmode_cur_get(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    at_key_value_get(SAVE_KEY_WIFI_MODE, &para->u.wifiMode.mode);
    FUN_DEBUG("----->\r\n");
    return AEC_OK;
}
static char cur_ssid[SYSINFO_SSID_LEN_MAX];
static char cur_psk[SYSINFO_PSK_LEN_MAX];
static AT_ERROR_CODE cwjap_cur(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  // uint32_t wep_open_connect_timeout_ms = 15500;
  // uint32_t timeout = xTaskGetTickCount() +
  // pdMS_TO_TICKS(wep_open_connect_timeout_ms);
  int wifiMode;
  int auto_conn;
  at_key_value_get(SAVE_KEY_WIFI_MODE, &wifiMode);

  if (wifiMode != WIFI_STATION_MODE && wifiMode != WIFI_AP_STA_MODE) {
      return AEC_CMD_FAIL;
  }
  __wifimode_set(wifiMode);

  memset(cur_ssid, 0, SYSINFO_SSID_LEN_MAX * sizeof(char));
  memset(cur_psk, 0, SYSINFO_PSK_LEN_MAX * sizeof(char));
  memcpy(cur_ssid, para->u.joinParam.ssid, strlen(para->u.joinParam.ssid));
  memcpy(cur_psk, para->u.joinParam.pwd, strlen(para->u.joinParam.pwd));
  FUN_DEBUG("----->\r\n");

  if (para->u.joinParam.ssid == NULL) {
    printf("The ssid is NULL");
    return AEC_CMD_ERROR;
  } else {
    // wlan_sta_disable();
    // OS_MSleep(50);
    // FIXME joinParam pwd field is less
    // wlan_sta_enable();
    wifi_mgmr_sta_connect(g_wifi_interface, (char *)para->u.joinParam.ssid,
                          (char *)para->u.joinParam.pwd, NULL, NULL, 0, 0);
    at_key_value_get(SAVE_KEY_WIFI_AUTO, &auto_conn);
    if (auto_conn) {
        wifi_mgmr_sta_autoconnect_enable();
    } else {
        wifi_mgmr_sta_autoconnect_disable();
    }
    at_key_value_set(SAVE_KEY_WIFI_SSID, &para->u.joinParam.ssid);
    at_key_value_set(SAVE_KEY_WIFI_PASK, &para->u.joinParam.pwd);
    // enable wifi autoreconnect
    return AEC_OK;
  }

  return AEC_CMD_ERROR;
}

static AT_ERROR_CODE cwjap_info(at_callback_para_t *para, at_callback_rsp_t *rsp) {
    wifi_mgmr_sta_connect_ind_stat_info_t info = {0};
    int state;
    ip4_addr_t ip = {0}, gw = {0}, mask = {0};

    wifi_mgmr_state_get(&state);

    if (state == WIFI_STATE_CONNECTED_IP_GETTING || state == WIFI_STATE_CONNECTED_IP_GOT) {
        wifi_mgmr_sta_connect_ind_stat_get(&info);
        wifi_mgmr_sta_ip_get(&ip.addr, &gw.addr, &mask.addr);
    }
    printf("---------------state %d-------------\r\n", state);

    at_dump("+CWJAP:%s,"
            "%02x:%02x:%02x:%02x:%02x:%02x,"
            "%s",
            info.ssid,
            info.bssid[0],
            info.bssid[1],
            info.bssid[2],
            info.bssid[3],
            info.bssid[4],
            info.bssid[5],
            ip4addr_ntoa(&ip));
    return AEC_OK;
}

#if 0
static AT_ERROR_CODE cwlapopt(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");
    return AEC_OK;
}


static AT_ERROR_CODE cwlap(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    scan(para, rsp);

    return AEC_OK;
}
#endif

static AT_ERROR_CODE cwqap(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");

  wifi_mgmr_sta_disconnect();
  vTaskDelay(1000);
  wifi_mgmr_sta_disable(NULL);

  return AEC_OK;
}

#if 0
static AT_ERROR_CODE cwdhcp_cur(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    save(para, rsp);

    return AEC_OK;
}

static AT_ERROR_CODE cipstamac_cur(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    save(para, rsp);

    return AEC_OK;
}


static AT_ERROR_CODE cipsta_cur(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    save(para, rsp);//ip_ipaddr

    return AEC_OK;
}


static AT_ERROR_CODE cwhostname(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    save(para, rsp);

    return AEC_OK;
}

static AT_ERROR_CODE cipdomain(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    struct hostent *server;
    //struct sockaddr_in serv_addr;

