bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    server = gethostbyname(para->u.dns_parse.hostname);
    if (server == NULL) {
        printf("not find the  host \r\n");
        return AEC_CMD_FAIL;
    }

    for(int i=0; server->h_addr_list[i]; i++) {
        printf("IP addr %d: %s\r\n", i+1, inet_ntoa( *(struct in_addr*)server->h_addr_list[i]));
    }

    at_dump("+IPDNS:\"%s\"\n",inet_ntoa( *(struct in_addr*)server->h_addr_list[0]));
    return AEC_OK;
}

#endif

static AT_ERROR_CODE cipstatus(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    uint16_t connect_cnt;

    FUN_DEBUG("----->\r\n");

    for (connect_cnt = 0; connect_cnt < MAX_SOCKET_NUM; connect_cnt++) {
        if (networks.connect[connect_cnt].flag) {
            at_dump("+CIPSTART:%d,%s,%s,%d",
                    connect_cnt,
                    networks.connect[connect_cnt].type,
                    networks.connect[connect_cnt].ip,
                    networks.connect[connect_cnt].port);
        }
    }

    return AEC_OK;
}

static AT_ERROR_CODE ap_sta_get(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    uint8_t cnt;
    uint8_t connected = 0;
    struct wifi_sta_basic_info sta_info;
    ip4_addr_t ip = {0}, gw = {0}, mask = {0};
    uint8_t mac[6];

    wifi_mgmr_ap_sta_cnt_get(&connected);
    wifi_mgmr_ap_ip_get(&ip.addr, &gw.addr, &mask.addr);
    wifi_mgmr_ap_mac_get(mac);
    at_dump("+SOFTAP:"
            "%s,"
            "%s,"
            "%02x:%02x:%02x:%02x:%02x:%02x\r\n",
            g_soft_ap_ssid,
            ip4addr_ntoa(&ip),
            mac[0],
            mac[1],
            mac[2],
            mac[3],
            mac[4],
            mac[5]);

    for (cnt = 0; cnt < connected; cnt++) {
        wifi_mgmr_ap_sta_info_get(&sta_info, cnt);
        if (!sta_info.is_used) {
            continue;
        }
        at_dump("+STA:%d,"
                "%02x:%02x:%02x:%02x:%02x:%02x,"
                "%d",
                sta_info.sta_idx,
                sta_info.sta_mac[0],
                sta_info.sta_mac[1],
                sta_info.sta_mac[2],
                sta_info.sta_mac[3],
                sta_info.sta_mac[4],
                sta_info.sta_mac[5],
                sta_info.rssi);
    }
    return AEC_OK;
}
static AT_ERROR_CODE set_apcfg(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    int psk_len, wifiMode;

    FUN_DEBUG("----->\r\n");

    at_key_value_get(SAVE_KEY_WIFI_MODE, &wifiMode);

    if (wifiMode != WIFI_SOFTAP_MODE && wifiMode != WIFI_AP_STA_MODE) {
        return AEC_CMD_FAIL;
    }
    __wifimode_set(wifiMode);

    psk_len = strlen(para->u.apcfgParam.psk);

    printf("para->u.apcfgParam.ssid=%s,para->u.apcfgParam.psk=%s\r\n",para->u.apcfgParam.ssid,para->u.apcfgParam.psk);

    if (psk_len > 0) {
        wifi_mgmr_ap_start(g_wifi_interface,
                           para->u.apcfgParam.ssid, 0,
                           para->u.apcfgParam.psk, 1);
    } else {
        wifi_mgmr_ap_start(g_wifi_interface,
                           para->u.apcfgParam.ssid, 0,
                           NULL, 1);
    }
    strcpy(g_soft_ap_ssid, para->u.apcfgParam.ssid);
    return AEC_OK;
}

typedef struct SocketSend_queueinf_def {
  int datalen;
  uint8_t *p_senddata;
} SocketSend_queueinf_t;

void socket0_task(void *pvParameters) {
  SocketSend_queueinf_t sendinf;
  int rc = -1;
  fd_set fdset;
  s32 timeout_ms = 100;

  fd_set frset;
  struct sockaddr_in address;
  socklen_t addr_len;

  struct timeval tv;

  uint8_t id = (u32)pvParameters;
  q_SocketSend[id] = xQueueCreate(QLEN_ATCMDSEND, sizeof(SocketSend_queueinf_t));
  if (q_SocketSend[id] == NULL) {
    printf("create queue %d failed\r\n", id);
    return;
  }

  while (1) {
    // 断开连接了，flag=0
    if (networks.connect[id].flag == 0) {
      xQueueReceive(q_SocketSend[id], &sendinf, pdMS_TO_TICKS(1));
      vTaskDelay(pdMS_TO_TICKS(100));
      continue;
    }
    if (xQueueReceive(q_SocketSend[id], &sendinf, pdMS_TO_TICKS(100)) == pdTRUE) {
      if (networks.connect[id].fd == -1) {
        at_dump("SOCKET %d ERROR", id);
        free(sendinf.p_senddata);
        continue;
      }

      if (networks.connect[id].protocol == 0) { /* TCP */

        FD_ZERO(&fdset);
        FD_SET(networks.connect[id].fd, &fdset);

        tv.tv_sec = timeout_ms / 1000;
        tv.tv_usec = (timeout_ms % 1000) * 1000;
        
        // XXX 既然用了select了，为什么还每个socket创建一个线程？
        rc = select(networks.connect[id].fd + 1, NULL, &fdset, NULL, &tv);
        if (rc > 0) {
          if ((rc = send(networks.connect[id].fd, sendinf.p_senddata, sendinf.datalen, 0)) > 0) {
            at_dump("+IPS:%d,OK", id);
          } else if (rc == 0) {
            disconnect(id);
          } else {
            disconnect(id);
          }
        } else if (rc == 0) {
          at_dump("+IPS:%d,TIMEOUT", id);
        } else {
          disconnect(id);
        }
      } else if (networks.connect[id].protocol == 1) { /* UDP */
        FD_ZERO(&fdset);
        FD_SET(networks.connect[id].fd, &fdset);

        tv.tv_sec = timeout_ms / 1000;
        tv.tv_usec = (timeout_ms % 1000) * 1000;

        address.sin_port = htons(networks.connect[id].port);
        address.sin_family = AF_INET;
        address.sin_addr.s_addr = inet_addr(networks.connect[id].ip);

        rc = select(networks.connect[id].fd + 1, NULL, &fdset, NULL, &tv);
        if (rc > 0) {
          if ((rc = sendto(networks.connect[id].fd, sendinf.p_senddata, sendinf.datalen, 0,
                           (struct sockaddr *)&address, sizeof(address))) > 0) {
            at_dump("+IPS:%d,OK", id);
          } else if (rc == 0) {
            disconnect(id);
          } else {
            disconnect(id);
          }
        } else if (rc == 0) {
          at_dump("+IPS:%d,TIMEOUT", id);
        } else {
          disconnect(id);
        }
      }
      free(sendinf.p_senddata);
    }

    tv.tv_sec = timeout_ms / 1000;
    tv.tv_usec = (timeout_ms % 1000) * 1000;

    FD_ZERO(&frset);
    FD_SET(networks.connect[id].fd, &frset);
    memset(socket_cache[id].buffer, 0, SOCKET_CACHE_BUFFER_SIZE);
    rc = select(networks.connect[id].fd + 1, &frset, NULL, NULL, &tv);
    if (rc > 0) {
      if (networks.connect[id].protocol == 0) { /* TCP */
        rc = recv(networks.connect[id].fd, socket_cache[id].buffer, SOCKET_CACHE_BUFFER_SIZE, 0);
      } else if (networks.connect[id].protocol == 1) { /* UDP */
        address.sin_port = htons(networks.connect[id].port);
        address.sin_family = AF_INET;
        address.sin_addr.s_addr = inet_addr(networks.connect[id].ip);

