bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
        addr_len = sizeof(address);

        rc = recvfrom(networks.connect[id].fd, socket_cache[id].buffer, SOCKET_CACHE_BUFFER_SIZE, 0,
                      (struct sockaddr *)&address, &addr_len);
      }

      if (rc > 0) {
        at_serial_lock();
        at_dump("+IPD:%d,%d", id, rc);
        at_data_output((char *)socket_cache[id].buffer, rc);
        at_serial_unlock();

      } else if (rc == 0) {
        disconnect(id);
      } else {
        disconnect(id);
      }
    } else if (rc == 0) {
    } else {
      disconnect(id);
    }
  }
}

AT_ERROR_CODE socket_task_create(int linkId) {
  char task_name[16] = {0};

  if (linkId >= MAX_SOCKET_NUM) {
    return AEC_SOCKET_FAIL;
  }

  sprintf(task_name, "socket%d_task", linkId);
  if (networks.connect[linkId].ThreadHd == 0) {
    if (xTaskCreate(socket0_task, task_name, SOCKET_TASK_STACK_SIZE, ((void *)linkId), 3,
                    &socket_task_handler[linkId]) != pdPASS) {
      FUN_DEBUG("socket task create error\r\n");
      return AEC_SOCKET_FAIL;
    }
    networks.connect[linkId].ThreadHd = 1;
  }

  return AEC_OK;
}

static AT_ERROR_CODE cipstart(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");
  static int is_sockon_task_create = 0;
  BaseType_t ret = pdPASS;

  memset(&sockontask_data, 0, sizeof(at_sockontask_para_t));
  memcpy(&sockontask_data.para, para, sizeof(at_callback_para_t));
  memcpy(&sockontask_data.rsp, rsp, sizeof(at_callback_rsp_t));

  if (0 == is_sockon_task_create) {
    is_sockon_task_create = 1;
    OS_queue_sockon_handler = xQueueCreate(10, sizeof(at_sockontask_para_t));
    if (OS_queue_sockon_handler == NULL) {
      FUN_DEBUG("queue create failed!\r\n");
      return AEC_SOCKET_FAIL;
    }

    ret = xTaskCreate(sockon_task, "sockon_task", 1024, NULL, 2, &OS_Thread_sockon_handler);
    vTaskDelay(pdMS_TO_TICKS(1));
    if (xQueueSend(OS_queue_sockon_handler, &sockontask_data, pdMS_TO_TICKS(200)) != pdPASS) {
      ret = pdFAIL;
    }
  } else {
    if (xQueueSend(OS_queue_sockon_handler, &sockontask_data, pdMS_TO_TICKS(200)) != pdPASS) {
      ret = pdFAIL;
    }
  }

  if (ret == pdPASS) {
    return AEC_OK;

  } else {
    FUN_DEBUG("sockon_task create error\r\n");
    return AEC_SOCKET_FAIL;
  }
}

static AT_ERROR_CODE cipsendbuf(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");

  return AEC_OK;
}

static AT_ERROR_CODE cipclose(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");

  if (para->u.close_id.id < MAX_SOCKET_NUM) {
      if (networks.connect[para->u.close_id.id].flag == 0) {
          return AEC_SOCKET_EXISTING;
      }
      disconnect(para->u.close_id.id);
      //at_dump("+CIPCLOSE:%d", para->u.close_id.id);
  } else {
      return AEC_PARA_ERROR;
  }
  return AEC_OK;
}

#if 0
static AT_ERROR_CODE tcpservermaxconn(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
#endif

static AT_ERROR_CODE tcpserver(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");
  s16 port;
  s32 protocol;
  int enable;

  port = para->u.tcp_server.port;
  enable = para->u.tcp_server.enable;
  protocol = 0; //tcp

  if (enable) {
    if (!g_server_enable) {
      g_server_arg.port = para->u.tcp_server.port;
      g_server_arg.protocol = 0;
      memset(&socket_cache[MAX_SOCKET_NUM], 0, sizeof(socket_cache_t));

      g_server_enable = 1;

      if (protocol == 0) { /* TCP */

        g_server_sem = xSemaphoreCreateBinary();
        if (g_server_sem == NULL) {
          FUN_DEBUG("create semaphore failed\r\n");

          return AEC_UNDEFINED;
        }

        memset(&g_server_ctrl, 0, sizeof(g_server_ctrl));
        if (xTaskCreate(server_task, "server_task", SERVER_THREAD_STACK_SIZE, (void *)&g_server_arg, 5, &server_task_handle) != pdPASS) {
          FUN_DEBUG("create server task failed\r\n");
          return AEC_UNDEFINED;
        }

      } else if (protocol == 1) { /* UDP */
        struct sockaddr_in address;
        int rc;
        int fd;

        fd = socket(AF_INET, SOCK_DGRAM, 0);
        if (fd < 0) {
          return AEC_SOCKET_FAIL;
        }

        memset(&address, 0, sizeof(address));
        address.sin_family = AF_INET;
        address.sin_addr.s_addr = htonl(INADDR_ANY);
        address.sin_port = htons(port);
        /* for receive */
        rc = bind(fd, (struct sockaddr *)&address, sizeof(address));
        if (rc < 0) {
          closesocket(fd);
          return AEC_BIND_FAIL;
        }
      }
      return AEC_OK;
    }
  } else {
    if (g_server_enable) {
      g_server_enable = 0;

      if (g_server_arg.protocol == 0) { /* TCP */
        vSemaphoreDelete(g_server_sem);
        if (serversock_fd >= 0) {
            closesocket(serversock_fd);
            serversock_fd = -1;
        }
        if (server_task_handle) {
            vTaskDelete(server_task_handle);
            server_task_handle = NULL;
        }
      } else if (g_server_arg.protocol == 1) { /* UDP */
        /* Do nothing */
      }
      return AEC_OK;
    }
  }

  return AEC_SOCKET_FAIL;
}
#if 0
static AT_ERROR_CODE cipdns_cur(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");
    ip_addr_t dnsip;

    memcpy((char *)(&dnsip), &para->u.set_dns.setdnsip, sizeof(at_ip_t));

    dns_setserver(0,&dnsip);
    return AEC_OK;

}

static AT_ERROR_CODE cipmux(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}


static AT_ERROR_CODE cipmode(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}

static AT_ERROR_CODE ciprecvdata(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
static AT_ERROR_CODE ciprecvmode(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
#endif

static SemaphoreHandle_t g_http_xSemaphore = NULL;
static void cb_httpc_result(void *arg, httpc_result_t httpc_result, u32_t rx_content_len, u32_t srv_res, err_t err)
{
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;
    printf("[HTTPC] Transfer finished err %d. rx_content_len is %lu\r\n", err, rx_content_len);
    if (rsp && (!rsp->vptr)) {
        at_dump_noend(AT_CMD_TAILED);
    }
    xSemaphoreGive(g_http_xSemaphore);
    if (err == 0) {
        at_dump("+RSP:OK");
    } else {
        at_dump("+RSP:%d", err);
    }
}

static err_t cb_httpc_headers_done_fn(httpc_state_t *connection, void *arg, struct pbuf *hdr, u16_t hdr_len, u32_t content_len)
{
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;

    printf("[HTTPC] hdr_len is %u, content_len is %lu\r\n", hdr_len, content_len);
    printf((char *)hdr->payload);
    if (rsp && (!rsp->vptr)) {
        at_dump_noend(AT_CMD_ECHOSTART);
        at_dump_noend("+HTTPC:%d,", content_len);
    }
    return ERR_OK;
}

static err_t cb_altcp_recv_fn(void *arg, struct altcp_pcb *conn, struct pbuf *p, err_t err)
{
    static int count = 0;
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;

    if (0 == ((count++) & 0x3F)) {
        puts("\r\n");
    }
    altcp_recved(conn, p->tot_len);
    if (rsp) {
        if (!rsp->vptr && p->tot_len) {
            at_data_output(p->payload, p->tot_len);
        } else if (strlen((char *)p->payload) <= rsp->vsize) {
            if (rsp->vptr) {
                strcpy(rsp->vptr, (char *)p->payload);
            }
        } else {
            printf("rsp buffer size not enought\r\n");
        }
    }
    //printf("%s\r\n", (char *)p->payload);
    pbuf_free(p);

    return ERR_OK;
}

static AT_ERROR_CODE http_url_req(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    char *uri = "/";
    char *param, *server_name;
    static httpc_connection_t settings;
    static httpc_state_t *req = NULL;
    in_addr_t ip_addr;
    char *p_port;
    int port = 80;

