bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    if (g_http_xSemaphore == NULL) {
        g_http_xSemaphore = xSemaphoreCreateBinary();
    }
    server_name = pvPortMalloc(128);
    if (server_name== NULL) {
        return AEC_CMD_FAIL;
    }
    memset(&settings, 0, sizeof(settings));
    settings.use_proxy = 0;
    settings.req_type  = para->u.http_req.type;
    settings.content_type = para->u.http_req.content_type;
    settings.data = para->u.http_req.data;
    settings.result_fn = cb_httpc_result;
    settings.headers_done_fn = cb_httpc_headers_done_fn;

    if ((param = strstr(para->u.http_req.hostname, uri)) == NULL) {
        param = uri;
    }
    strcpy(server_name, para->u.http_req.hostname);
    server_name[param - para->u.http_req.hostname] = '\0';
    if ((p_port = strstr(server_name, ":")) != NULL) {
        p_port[0] = '\0';
        p_port++;
        port = atoi(p_port);
    }
    if ((ip_addr = inet_addr(server_name)) != INADDR_NONE) {
        httpc_get_file((const ip_addr_t* )&ip_addr,
                        port,
                        param,
                        &settings,
                        cb_altcp_recv_fn,
                        rsp,
                        &req);
    } else {
        httpc_get_file_dns(
                server_name,
                port,
                param,
                &settings,
                cb_altcp_recv_fn,
                rsp,
                &req);
    }

    if (xSemaphoreTake(g_http_xSemaphore, (TickType_t)-1) != pdTRUE) {
        vPortFree(server_name);
        return AEC_NETWORK_ERROR;
    }
    vPortFree(server_name);
    return AEC_OK;
}

static AT_ERROR_CODE cipsend(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    s32 id;
    u8 *buffer;
    s32 len;
    FUN_DEBUG("------>%s\r\n",__func__);

    SocketSend_queueinf_t sendinf;

    id      = para->u.sockw.id;
    buffer  = para->u.sockw.buf;
    len     = para->u.sockw.len;

    if (id >= MAX_SOCKET_NUM) {
        return AEC_DISCONNECT;
    }

    printf("id:%d, len:%d, buffer:%s\r\n", id, len, buffer);
    sendinf.p_senddata = malloc(SOCKET_CACHE_BUFFER_SIZE);
    if(sendinf.p_senddata == NULL) {
        at_dump("malloc buffer for atcmdSend failed");
        return AEC_CMD_ERROR;
    }
    sendinf.datalen =  len;
    FUN_DEBUG("------>%s memcpy id = %d\r\n",__func__, id);
    memcpy(sendinf.p_senddata, buffer, len);
    printf("q_SocketSend[%d] = %p\r\n", id, q_SocketSend[id]);
    if (xQueueSend(q_SocketSend[id], &sendinf, pdMS_TO_TICKS(10)) != pdPASS) {
        at_dump("LinkId %d Send ERROR", id);
        FUN_DEBUG("LinkId %d Send ERROR \r\n", id);
        free(sendinf.p_senddata);
    }
    FUN_DEBUG("------>%s xQueueSend Success\r\n",__func__);
    return AEC_OK;
}

#if 0
int is_netconnet_ap(void)
{
    if((net_evevt_state == NET_CTRL_MSG_NETWORK_UP) || (net_evevt_state == NET_CTRL_MSG_WLAN_CONNECTED))
        return 1;

    return 0;
}

typedef struct {
    GPIO_Pin    GPIONum;
    GPIO_Port   GPIOPort;
    GPIO_InitParam  GPIOPara;
} GPIO_CFG;
GPIO_CFG BoardGPIO[3]=
{
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}},
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}},
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}}
};

static AT_ERROR_CODE sysiosetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp)
{

    if(para->u.setgpio_para.ID > 2)
        return AEC_PARA_ERROR;

    para->u.setgpio_para.ID -= para->u.setgpio_para.ID;

    BoardGPIO[para->u.setgpio_para.ID].GPIOPara.driving = GPIO_DRIVING_LEVEL_1;

    if(para->u.setgpio_para.mode <= 1)
        BoardGPIO[para->u.setgpio_para.ID].GPIOPara.mode = para->u.setgpio_para.mode;
    else
        return AEC_PARA_ERROR;

    if(para->u.setgpio_para.pull <= 2)
        BoardGPIO[para->u.setgpio_para.ID].GPIOPara.pull = para->u.setgpio_para.pull;
    else
        return AEC_PARA_ERROR;

    HAL_GPIO_Init(BoardGPIO[para->u.setgpio_para.ID].GPIOPort,  \
                    BoardGPIO[para->u.setgpio_para.ID].GPIONum, \
                    &BoardGPIO[para->u.setgpio_para.ID].GPIOPara);

    return AEC_OK;
}


static AT_ERROR_CODE sysiogetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    char *modestr[]={"Input","Output"};
    char *pullstr[]={"pull none","pull up","pull down"};
    at_dump("OI1 driver level is %d\r\n",BoardGPIO[0].GPIOPara.driving);
    at_dump("OI1 mode is %s\r\n",modestr[BoardGPIO[0].GPIOPara.mode]);
    at_dump("OI1 pull is %s\r\n",pullstr[BoardGPIO[0].GPIOPara.pull]);

    at_dump("OI2 driver level is %d\r\n",BoardGPIO[1].GPIOPara.driving);
    at_dump("OI2 mode is %s\r\n",modestr[BoardGPIO[1].GPIOPara.mode]);
    at_dump("OI2 pull is %s\r\n",pullstr[BoardGPIO[1].GPIOPara.pull]);

    at_dump("OI3 driver level is %d\r\n",BoardGPIO[2].GPIOPara.driving);
    at_dump("OI3 mode is %s\r\n",modestr[BoardGPIO[2].GPIOPara.mode]);
    at_dump("OI3 pull is %s\r\n",pullstr[BoardGPIO[2].GPIOPara.pull]);

    return AEC_OK;
}


static AT_ERROR_CODE syssetiodir(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.setiodir_para.ID > 2)
        return AEC_PARA_ERROR;

    if(para->u.setiodir_para.mode <= 1)
        BoardGPIO[para->u.setiodir_para.ID].GPIOPara.mode = para->u.setiodir_para.mode;
    else
        return AEC_PARA_ERROR;

    HAL_GPIO_Init(BoardGPIO[para->u.setiodir_para.ID].GPIOPort,     \
                    BoardGPIO[para->u.setiodir_para.ID].GPIONum,    \
                    &BoardGPIO[para->u.setiodir_para.ID].GPIOPara);

    return AEC_OK;
}

static AT_ERROR_CODE syssetgpio(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.writeiodata_para.ID > 2)
        return AEC_PARA_ERROR;

    if(para->u.writeiodata_para.data == 0)
    {
        HAL_GPIO_WritePin(BoardGPIO[para->u.writeiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.writeiodata_para.ID].GPIONum, \
                        GPIO_PIN_LOW);
    }
    else
    {
        HAL_GPIO_WritePin(BoardGPIO[para->u.writeiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.writeiodata_para.ID].GPIONum, \
                        GPIO_PIN_HIGH);
    }

    return AEC_OK;
}

static AT_ERROR_CODE sysreadgpio(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.readiodata_para.ID > 2)
        return AEC_PARA_ERROR;

    at_dump("Level is %d\r\n",HAL_GPIO_ReadPin(BoardGPIO[para->u.readiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.readiodata_para.ID].GPIONum));
    return AEC_OK;
}

